#coding :UTF-8
print ("first blood")
print("Hi programmer!")
num = 10/3
print (num)
print (type(num))
# деление целого цисла  с выводом результата операции и типом обьекта
num = 10//3
print (num)
print (type(num))
# Целочисленное деление  с выводом результата операции и типом обьекта
num = 10%3
print (num)
print (type(num))
# Остаток от деления  с выводом результата операции и типом обьекта
num = 10**3
print (num)
print (type(num))
# Возведение в степень  с выводом результата операции и типом обьекта
num = 10*3+1
print (num)
print (type(num))
# Умножение и сложение челых чисел с выводом результата операции и типом обьекта
num = 10*(3+1)
print (num)
print (type(num))
# сложение целого цисла и умножение(операции в скобках выполняються первыми)с выводом результата операции и типом обьекта

